ds4p-sender/orchestration/service/src/test/resources/securedFilterC32fullSOAPMessage.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<Action xmlns="http://www.w3.org/2005/08/addressing"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			wsu:Id="Id-1689409152">http://apache.org/hello_world_soap_http/Greeter/greetMeRequest
		</Action>
		<MessageID xmlns="http://www.w3.org/2005/08/addressing"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			wsu:Id="Id-204409815">urn:uuid:fd3cbcda-7758-4671-9952-b7a6582da827</MessageID>
		<To xmlns="http://www.w3.org/2005/08/addressing"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			wsu:Id="Id-554356365">http://localhost:9001/SoapContext/SoapPort</To>
		<ReplyTo xmlns="http://www.w3.org/2005/08/addressing"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			wsu:Id="Id-1283365869">
			<Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
		</ReplyTo>
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			soap:mustUnderstand="1">
			<wsu:Timestamp wsu:Id="TS-9">
				<wsu:Created>2013-02-03T12:00:00.352Z</wsu:Created>
				<wsu:Expires>2013-02-03T12:00:00.352Z</wsu:Expires>
			</wsu:Timestamp>
			
			<saml2:Assertion xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion"
				xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#"
				xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:xs="http://www.w3.org/2001/XMLSchema"
				ID="1359878955930" IssueInstant="2013-02-03T03:09:15.930-05:00"
				Version="2.0">
				<saml2:Issuer
					Format="urn:oasis:names:tc:SAML:2.0:nameid-format:X509SubjectName">CN=DrDuane,OU=HIG,O=Dept. of Veterans
					Affairs,L=Missoula,ST=MT,C=US</saml2:Issuer>
				<ds:Signature>
					<ds:SignedInfo>
						<ds:CanonicalizationMethod
							Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
						<ds:Reference URI="#1359878955930">
							<ds:Transforms>
								<ds:Transform
									Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" />
								<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
							</ds:Transforms>
							<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
							<ds:DigestValue>0WAPl0FN0O1k9iIDu9kE6FspivU=</ds:DigestValue>
						</ds:Reference>
					</ds:SignedInfo>
					<ds:SignatureValue>Oktrkk1aEtn1W+Wv5U8zp28zfXdHxkGXDVnPjwgcnyXlnqEnhymLy4Tj2LfYd/1Qw/uZNKSag0YL
						bxgpR0hw5zaMQuKq6lTUF/xYCIALk2Qg63PG+0G8/K+MNI3tQwWkJoEhTZ4sG6gM0qwZx7b8GfvI
						QMun9AmGs5X1/xtmDh4=
					</ds:SignatureValue>
					<ds:KeyInfo>
						<ds:KeyValue>
							<ds:RSAKeyValue>
								<ds:Modulus>vYxVZKIzVdGMSBkW4bYnV80MV/RgQKV1bf/DoMTX8laMO45P6rlEarxQiOYrgzuYp+snzz2XM0S6
									o3JGQtXQuzDwcwPkH55bHFwHgtOMzxG4SQ653a5Dzh04nsmJvxvbncNH/XNaWfHaC0JHBEfNCMwR
									ebYocxYM92pq/G5OGyE=
								</ds:Modulus>
								<ds:Exponent>AQAB</ds:Exponent>
							</ds:RSAKeyValue>
						</ds:KeyValue>
					</ds:KeyInfo>
				</ds:Signature>
				<saml2:Subject>
					<saml2:NameID
						Format="urn:oasis:names:tc:SAML:2.0:nameid-format:X509SubjectName">CN=DrDuane,OU=HIG,O=Dept. of Veterans
						Affairs,L=Missoula,ST=MT,C=US</saml2:NameID>
					<saml2:SubjectConfirmation
						Method="urn:oasis:names:tc:SAML:2.0:cm:holder-of-key">
						<saml2:NameID
							Format="urn:oasis:names:tc:SAML:2.0:nameid-format:X509SubjectName">CN=DrDuane,OU=HIG,O=Dept. of Veterans
							Affairs,L=Missoula,ST=MT,C=US</saml2:NameID>
						<saml2:SubjectConfirmationData>
							<ds:KeyInfo>
								<ds:KeyValue>
									<ds:RSAKeyValue>
										<ds:Modulus>vYxVZKIzVdGMSBkW4bYnV80MV/RgQKV1bf/DoMTX8laMO45P6rlEarxQiOYrgzuYp+snzz2XM0S6o3JGQtXQuzDwcwPkH55bHFwHgtOMzxG4SQ653a5Dzh04nsmJvxvbncNH/XNaWfHaC0JHBEfNCMwRebYocxYM92pq/G5OGyE=
										</ds:Modulus>
										<ds:Exponent>AQAB</ds:Exponent>
									</ds:RSAKeyValue>
								</ds:KeyValue>
							</ds:KeyInfo>
						</saml2:SubjectConfirmationData>
					</saml2:SubjectConfirmation>
				</saml2:Subject>
				<saml2:Conditions NotBefore="2013-02-07T02:09:15.930-05:00"
					NotOnOrAfter="2013-02-10T04:09:15.930-05:00" />
				<saml2:AttributeStatement>
					<saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:subject-id">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">Duane_Decouteau@direct.healthvault-stage.com
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:locality">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">2.16.840.1.113883.4.349
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">MD/Allopath
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">TREAT
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute
						Name="urn:oasis:names:tc:xspa:2.0:subject:sensitivity:privileges">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">ETH
						</saml2:AttributeValue>
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">PSY
						</saml2:AttributeValue>
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">HIV
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:gov:hhs:fha:nhinc:service-type">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">DocumentQuery
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute
						Name="urn:oasis:names:tc:xacml:1.0:resource:resource-id">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">PUI100010060001
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xspa:2.0:resource:type">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">C32
						</saml2:AttributeValue>
					</saml2:Attribute>
					<saml2:Attribute Name="urn:oasis:names:tc:xacml:1.0:action:action-id">
						<saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
							xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string">Execute
						</saml2:AttributeValue>
					</saml2:Attribute>
				</saml2:AttributeStatement>
			</saml2:Assertion>
		</wsse:Security>
	</soap:Header>
	<soap:Body
		xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
		wsu:Id="Id-1223205528">
		<ns2:RetrieveDocumentSetRequest
			xmlns:ns2="http://www.samhsa.gov/ds4ppilot/schema/securedorchestrator" />
	</soap:Body>
</soap:Envelope>